## Terraform Plan 📋

<details>
<summary>Show Plan</summary>

```terraform
module.eks_cluster.module.eks.data.aws_partition.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Reading...
module.networking.data.aws_region.current: Reading...
module.networking.module.vpc.data.aws_region.current[0]: Reading...
module.security.data.aws_caller_identity.current: Reading...
module.container_registry.aws_ecr_repository.this: Refreshing state... [id=ml-platform-api]
module.networking.data.aws_region.current: Read complete after 0s [id=us-west-2]
module.eks_cluster.module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.networking.module.vpc.data.aws_region.current[0]: Read complete after 0s [id=us-west-2]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Reading...
module.networking.module.vpc.data.aws_iam_policy_document.flow_log_cloudwatch_assume_role[0]: Read complete after 0s [id=1021377347]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.networking.module.vpc.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks_cluster.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.security.data.aws_caller_identity.current: Read complete after 1s [id=984479408136]
module.networking.module.vpc.data.aws_caller_identity.current[0]: Read complete after 1s [id=984479408136]
module.eks_cluster.module.eks.data.aws_caller_identity.current[0]: Read complete after 1s [id=984479408136]
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Reading...
module.eks_cluster.module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::984479408136:assumed-role/GitHubActions-AssumeRoleForActions/GitHubActions-TF-Plan-19216043587]
module.container_registry.aws_ecr_lifecycle_policy.this: Refreshing state... [id=ml-platform-api]
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Reading...
module.eks_cluster.module.eks.module.eks_managed_node_group["main"].data.aws_ssm_parameter.ami[0]: Read complete after 0s [id=/aws/service/eks/optimized-ami/1.34/amazon-linux-2023/x86_64/standard/recommended/release_version]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks_cluster.data.aws_iam_policy_document.ebs_csi_driver_assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "ebs_csi_driver_assume_role" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRoleWithWebIdentity",
            ]
          + effect  = "Allow"

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "sts.amazonaws.com",
                ]
              + variable = (known after apply)
            }
          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "system:serviceaccount:kube-system:ebs-csi-controller-sa",
                ]
              + variable = (known after apply)
            }

          + principals {
              + identifiers = [
                  + (known after apply),
                ]
              + type        = "Federated"
            }
        }
    }

  # module.eks_cluster.aws_iam_role.ebs_csi_driver[0] will be created
  + resource "aws_iam_role" "ebs_csi_driver" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ml-platform-dev-ebs-csi-"
      + path                  = "/"
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-ebs-csi-driver"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-ebs-csi-driver"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.aws_iam_role.node_group will be created
  + resource "aws_iam_role" "node_group" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IAM role for EKS managed node group ml-platform-dev"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ml-platform-dev-ng-"
      + path                  = "/"
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-node-group-role"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-node-group-role"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.ebs_csi_driver[0] will be created
  + resource "aws_iam_role_policy_attachment" "ebs_csi_driver" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AmazonEBSCSIDriverPolicy"
      + role       = (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ec2_container_registry_read_only will be created
  + resource "aws_iam_role_policy_attachment" "node_group_amazon_ec2_container_registry_read_only" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_cni_policy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_amazon_eks_cni_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_eks_worker_node_policy will be created
  + resource "aws_iam_role_policy_attachment" "node_group_amazon_eks_worker_node_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = (known after apply)
    }

  # module.eks_cluster.aws_iam_role_policy_attachment.node_group_amazon_ssm_managed_instance_core[0] will be created
  + resource "aws_iam_role_policy_attachment" "node_group_amazon_ssm_managed_instance_core" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = (known after apply)
    }

  # module.networking.aws_security_group.vpc_endpoints will be created
  + resource "aws_security_group" "vpc_endpoints" {
      + arn                    = (known after apply)
      + description            = "Security group for VPC endpoints (ECR, STS, EC2)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound - required for VPC endpoints to reach AWS services"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.0.0.0/16",
                ]
              + description      = "Allow HTTPS from VPC"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "ml-platform-dev-vpc-vpc-endpoints-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-vpc-endpoints-sg"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-vpc-endpoints-sg"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_vpc_endpoint.autoscaling will be created
  + resource "aws_vpc_endpoint" "autoscaling" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.autoscaling"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-autoscaling-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-autoscaling-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ec2 will be created
  + resource "aws_vpc_endpoint" "ec2" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.ec2"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ec2-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ec2-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ecr-api-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ecr-api-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-ecr-dkr-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-ecr-dkr-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.s3 will be created
  + resource "aws_vpc_endpoint" "s3" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "s3:GetObject",
                          + "s3:ListBucket",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "*"
                        }
                      + Resource  = [
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                        ]
                    },
                  + {
                      + Action      = "s3:*"
                      + Effect      = "Deny"
                      + NotResource = [
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket",
                          + "arn:aws:s3:::prod-us-west-2-starport-layer-bucket/*",
                        ]
                      + Principal   = {
                          + AWS = "*"
                        }
                      + Resource    = "arn:aws:s3:::*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = (known after apply)
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.s3"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-s3-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-s3-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Gateway"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.networking.aws_vpc_endpoint.sts will be created
  + resource "aws_vpc_endpoint" "sts" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + region                = "us-west-2"
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = (known after apply)
      + service_name          = "com.amazonaws.us-west-2.sts"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = (known after apply)
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-sts-endpoint"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-sts-endpoint"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = (known after apply)

      + dns_options (known after apply)

      + subnet_configuration (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.34"
      + most_recent        = true
      + region             = (known after apply)
      + version            = (known after apply)
    }

  # module.eks_cluster.module.eks.data.tls_certificate.this[0] will be read during apply
  # (config refers to values not yet known)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/eks/ml-platform-dev/cluster"
      + name_prefix       = (known after apply)
      + region            = "us-west-2"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "/aws/eks/ml-platform-dev/cluster"
        }
      + tags_all          = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "/aws/eks/ml-platform-dev/cluster"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Cluster"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Cluster"
      + region      = "us-west-2"
      + resource_id = (known after apply)
      + value       = "ml-platform-dev"
    }

  # module.eks_cluster.module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"] will be created
  + resource "aws_ec2_tag" "cluster_primary_security_group" {
      + id          = (known after apply)
      + key         = "Environment"
      + region      = "us-west-2"
      + resource_id = (known after apply)
      + value       = "dev"
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "aws-ebs-csi-driver"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + service_account_role_arn    = (known after apply)
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["coredns"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "coredns"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["kube-proxy"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "kube-proxy"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_addon.this["vpc-cni"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "vpc-cni"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = (known after apply)
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + region                      = "us-west-2"
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags                        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                    = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }

      + timeouts {}
    }

  # module.eks_cluster.module.eks.aws_eks_cluster.this[0] will be created
  + resource "aws_eks_cluster" "this" {
      + arn                           = (known after apply)
      + bootstrap_self_managed_addons = false
      + certificate_authority         = (known after apply)
      + cluster_id                    = (known after apply)
      + created_at                    = (known after apply)
      + deletion_protection           = (known after apply)
      + enabled_cluster_log_types     = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                      = (known after apply)
      + id                            = (known after apply)
      + identity                      = (known after apply)
      + name                          = "ml-platform-dev"
      + platform_version              = (known after apply)
      + region                        = "us-west-2"
      + role_arn                      = (known after apply)
      + status                        = (known after apply)
      + tags                          = {
          + "Cluster"               = "ml-platform-dev"
          + "Environment"           = "dev"
          + "terraform-aws-modules" = "eks"
        }
      + tags_all                      = {
          + "Cluster"               = "ml-platform-dev"
          + "Environment"           = "dev"
          + "ManagedBy"             = "Terraform"
          + "Owner"                 = "wlevan3"
          + "Project"               = "ml-platform-engineering-practicum"
          + "terraform-aws-modules" = "eks"
        }
      + version                       = "1.34"

      + access_config {
          + authentication_mode                         = "API_AND_CONFIG_MAP"
          + bootstrap_cluster_creator_admin_permissions = false
        }

      + compute_config (known after apply)

      + kubernetes_network_config {
          + ip_family         = "ipv4"
          + service_ipv4_cidr = (known after apply)
          + service_ipv6_cidr = (known after apply)

          + elastic_load_balancing (known after apply)
        }

      + storage_config (known after apply)

      + upgrade_policy (known after apply)

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = (known after apply)
          + security_group_ids        = (known after apply)
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # module.eks_cluster.module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-eks-irsa"
        }
      + tags_all        = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-eks-irsa"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + thumbprint_list = (known after apply)
      + url             = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = [
                          + "sts:TagSession",
                          + "sts:AssumeRole",
                        ]
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                      + Sid       = "EKSClusterAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "ml-platform-dev-cluster-"
      + path                  = "/"
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.eks_cluster.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_security_group.cluster[0] will be created
  + resource "aws_security_group" "cluster" {
      + arn                    = (known after apply)
      + description            = "EKS cluster security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ml-platform-dev-cluster-"
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-cluster"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-cluster"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_security_group.node[0] will be created
  + resource "aws_security_group" "node" {
      + arn                    = (known after apply)
      + description            = "EKS node shared security group"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "ml-platform-dev-node-"
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-node"
          + "kubernetes.io/cluster/ml-platform-dev" = "owned"
        }
      + tags_all               = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-node"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "owned"
        }
      + vpc_id                 = (known after apply)
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.cluster["egress_nodes_ephemeral_ports_tcp"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "To node 1025-65535"
      + from_port                = 1025
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 65535
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.cluster["ingress_nodes_443"] will be created
  + resource "aws_security_group_rule" "cluster" {
      + description              = "Node groups to cluster API"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "DNS resolution (TCP)"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_dns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "DNS resolution (UDP)"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_https"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "HTTPS for ECR, EKS API, VPC endpoints, and external services"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "Kubelet API for node communication"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_node_ports"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "NodePort services range"
      + from_port                = 30000
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 32767
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["egress_ntp"] will be created
  + resource "aws_security_group_rule" "node" {
      + cidr_blocks              = [
          + "10.0.0.0/16",
        ]
      + description              = "NTP time synchronization"
      + from_port                = 123
      + id                       = (known after apply)
      + protocol                 = "udp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 123
      + type                     = "egress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_443"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node groups"
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 443
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster API to node kubelets"
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_cluster_to_node_all_traffic"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Cluster to node all traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_all"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node all ports/protocols"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"] will be created
  + resource "aws_security_group_rule" "node" {
      + description              = "Node to node CoreDNS UDP"
      + from_port                = 53
      + id                       = (known after apply)
      + protocol                 = "udp"
      + region                   = "us-west-2"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 53
      + type                     = "ingress"
    }

  # module.eks_cluster.module.eks.time_sleep.this[0] will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "certificate_authority_data" = (known after apply)
          + "endpoint"                   = (known after apply)
          + "kubernetes_version"         = "1.34"
          + "name"                       = (known after apply)
          + "service_cidr"               = (known after apply)
        }
    }

  # module.networking.module.vpc.data.aws_iam_policy_document.vpc_flow_log_cloudwatch[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "vpc_flow_log_cloudwatch" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogStream",
              + "logs:DescribeLogGroups",
              + "logs:DescribeLogStreams",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "AWSVPCFlowLogsPushToCloudWatch"
        }
    }

  # module.networking.module.vpc.aws_cloudwatch_log_group.flow_log[0] will be created
  + resource "aws_cloudwatch_log_group" "flow_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = (known after apply)
      + name_prefix       = (known after apply)
      + region            = "us-west-2"
      + retention_in_days = 90
      + skip_destroy      = false
      + tags              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all          = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_default_network_acl.this[0] will be created
  + resource "aws_default_network_acl" "this" {
      + arn                    = (known after apply)
      + default_network_acl_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-default"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-default"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id                 = (known after apply)

      + egress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + egress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }

      + ingress {
          + action          = "allow"
          + from_port       = 0
          + ipv6_cidr_block = "::/0"
          + protocol        = "-1"
          + rule_no         = 101
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
      + ingress {
          + action          = "allow"
          + cidr_block      = "0.0.0.0/0"
          + from_port       = 0
          + protocol        = "-1"
          + rule_no         = 100
          + to_port         = 0
            # (1 unchanged attribute hidden)
        }
    }

  # module.networking.module.vpc.aws_default_route_table.default[0] will be created
  + resource "aws_default_route_table" "default" {
      + arn                    = (known after apply)
      + default_route_table_id = (known after apply)
      + id                     = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + route                  = (known after apply)
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-default"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-default"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id                 = (known after apply)

      + timeouts {
          + create = "5m"
          + update = "5m"
        }
    }

  # module.networking.module.vpc.aws_default_security_group.this[0] will be created
  + resource "aws_default_security_group" "this" {
      + arn                    = (known after apply)
      + description            = (known after apply)
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "us-west-2"
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-default"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-default"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + ipam_pool_id         = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + region               = "us-west-2"
      + tags                 = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
        }
      + tags_all             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_flow_log.this[0] will be created
  + resource "aws_flow_log" "this" {
      + arn                      = (known after apply)
      + iam_role_arn             = (known after apply)
      + id                       = (known after apply)
      + log_destination          = (known after apply)
      + log_destination_type     = "cloud-watch-logs"
      + log_format               = (known after apply)
      + max_aggregation_interval = 60
      + region                   = "us-west-2"
      + tags                     = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all                 = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + traffic_type             = "ALL"
      + vpc_id                   = (known after apply)
    }

  # module.networking.module.vpc.aws_iam_policy.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_policy" "vpc_flow_log_cloudwatch" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "vpc-flow-log-to-cloudwatch-"
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all         = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_iam_role.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role" "vpc_flow_log_cloudwatch" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "vpc-flow-logs.amazonaws.com"
                        }
                      + Sid       = "AWSVPCFlowLogsAssumeRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "vpc-flow-log-role-"
      + path                  = "/"
      + tags                  = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
        }
      + tags_all              = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.networking.module.vpc.aws_iam_role_policy_attachment.vpc_flow_log_cloudwatch[0] will be created
  + resource "aws_iam_role_policy_attachment" "vpc_flow_log_cloudwatch" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.networking.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + region   = "us-west-2"
      + tags     = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc"
        }
      + tags_all = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + region                             = "us-west-2"
      + secondary_allocation_ids           = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = (known after apply)
      + tags                               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
        }
      + tags_all                           = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-us-west-2a"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.networking.module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-west-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.networking.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + region                 = "us-west-2"
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.networking.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-west-2"
      + route            = (known after apply)
      + tags             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-private"
        }
      + tags_all         = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-private"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + region           = "us-west-2"
      + route            = (known after apply)
      + tags             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc-public"
        }
      + tags_all         = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc-public"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_route_table_association.public[2] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + region         = "us-west-2"
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2a"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2a"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2b"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2b"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.3.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2c"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-private-us-west-2c"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/internal-elb"       = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2a"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2a"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2b"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2b"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_subnet.public[2] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-west-2c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.103.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + region                                         = "us-west-2"
      + tags                                           = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2c"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + tags_all                                       = {
          + "Cluster"                               = "ml-platform-dev"
          + "Environment"                           = "dev"
          + "ManagedBy"                             = "Terraform"
          + "Name"                                  = "ml-platform-dev-vpc-public-us-west-2c"
          + "Owner"                                 = "wlevan3"
          + "Project"                               = "ml-platform-engineering-practicum"
          + "kubernetes.io/cluster/ml-platform-dev" = "shared"
          + "kubernetes.io/role/elb"                = "1"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + region                               = "us-west-2"
      + tags                                 = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-vpc"
        }
      + tags_all                             = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-vpc"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "AL2023_x86_64_STANDARD"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = (known after apply)
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.micro",
        ]
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "ml-platform-dev-ng-"
      + node_role_arn          = (known after apply)
      + region                 = "us-west-2"
      + release_version        = "1.34.1-20251103"
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-ng"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-ng"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + version                = "1.34"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = (known after apply)
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 4
          + min_size     = 1
        }

      + update_config {
          + max_unavailable_percentage = 33
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].aws_launch_template.this[0] will be created
  + resource "aws_launch_template" "this" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + description            = "Custom launch template for ml-platform-dev-ng EKS managed node group"
      + id                     = (known after apply)
      + latest_version         = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "main-"
      + region                 = "us-west-2"
      + tags                   = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "Name"        = "ml-platform-dev-worker-node"
        }
      + tags_all               = {
          + "Cluster"     = "ml-platform-dev"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "ml-platform-dev-worker-node"
          + "Owner"       = "wlevan3"
          + "Project"     = "ml-platform-engineering-practicum"
        }
      + update_default_version = true
      + vpc_security_group_ids = (known after apply)
        # (2 unchanged attributes hidden)

      + block_device_mappings {
          + device_name = "/dev/xvda"

          + ebs {
              + delete_on_termination      = "true"
              + encrypted                  = "true"
              + iops                       = (known after apply)
              + throughput                 = (known after apply)
              + volume_initialization_rate = (known after apply)
              + volume_size                = 30
              + volume_type                = "gp3"
            }
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = (known after apply)
          + http_put_response_hop_limit = 1
          + http_tokens                 = "required"
          + instance_metadata_tags      = "enabled"
        }

      + tag_specifications {
          + resource_type = "instance"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
      + tag_specifications {
          + resource_type = "network-interface"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
      + tag_specifications {
          + resource_type = "volume"
          + tags          = {
              + "Cluster"     = "ml-platform-dev"
              + "Environment" = "dev"
              + "Name"        = "ml-platform-dev-ng"
            }
        }
    }

  # module.eks_cluster.module.eks.module.eks_managed_node_group["main"].module.user_data.null_resource.validate_cluster_service_cidr will be created
  + resource "null_resource" "validate_cluster_service_cidr" {
      + id = (known after apply)
    }

Plan: 73 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ cluster_certificate_authority_data = (sensitive value)
  ~ cluster_endpoint                   = "https://3A50FFDDB0C9040F135E2F16968D44B7.gr7.us-west-2.eks.amazonaws.com" -> (known after apply)
  + cluster_id                         = (known after apply)
  + cluster_name                       = (known after apply)
  ~ cluster_security_group_id          = "sg-016773c24bd3bf902" -> (known after apply)
  ~ node_security_group_id             = "sg-0c682263702172459" -> (known after apply)
  ~ oidc_provider_arn                  = "arn:aws:iam::984479408136:oidc-provider/oidc.eks.us-west-2.amazonaws.com/id/3A50FFDDB0C9040F135E2F16968D44B7" -> (known after apply)
  ~ private_subnet_ids                 = [
      ~ "subnet-089b84d402fd388ff" -> (known after apply),
      ~ "subnet-08b61f39bef93fc7e" -> (known after apply),
      ~ "subnet-0a93e8a950f7a4da7" -> (known after apply),
    ]
  ~ public_subnet_ids                  = [
      ~ "subnet-08b58f4d0ea68a212" -> (known after apply),
      ~ "subnet-019888ac1266a9e2d" -> (known after apply),
      ~ "subnet-07c0937b82ee3c74b" -> (known after apply),
    ]
  ~ vpc_id                             = "vpc-0a4dc7d098adfbaac" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

**Event**: `pull_request`
**Run**: [#19216043587](https://github.com/wlevan3/ml-platform-engineering-practicum/actions/runs/19216043587)
